_posts/2017-03-24-twitter-bot.html
---
layout:     post
title:      How to Build a Twitter-Bot
date:       2017-03-24
summary:    There is a command-line twitter client that can be used to send tweets
    to a certain account from terminal. Combining it with cron and other linux tools
    I have built a twitter-bot that sends proverbs periodically to twitter
    (https://twitter.com/l10n_sq). I will describe here how I did it.
tags:       [linux twitter]
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-25 Sat 00:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Build a Twitter-Bot</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">How to Build a Twitter-Bot</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Accessing twitter from the terminal</a></li>
<li><a href="#orgheadline2">2. Getting random proverbs with 'fortune'</a></li>
<li><a href="#orgheadline3">3. Twitting random items from your lists</a></li>
<li><a href="#orgheadline4">4. Making it automatic</a></li>
<li><a href="#orgheadline5">5. Twitting translations from l10n.org.al</a></li>
</ul>
</div>
</div>

<p>
There is a command-line twitter client that can be used to send tweets
to a certain account from terminal. Combining it with cron and other
linux tools I have built a twitter-bot that sends proverbs
periodically to twitter (<a href="https://twitter.com/l10n_sq">https://twitter.com/l10n_sq</a>). I will describe
here how I did it.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Accessing twitter from the terminal</h2>
<div class="outline-text-2" id="text-1">
<p>
There is a <a href="https://github.com/sferik/t">single-letter tool called "t"</a>, which is a command-line
Twitter client written in Ruby. I installed and configured it as
described in this tutorial:
<a href="http://xmodulo.com/access-twitter-command-line-linux.html">http://xmodulo.com/access-twitter-command-line-linux.html</a>.
</p>

<p>
The installation is simple:
</p>
<pre class="example">
apt-get install ruby-dev
gem install t
</pre>

<p>
Then create a new app on twitter: <a href="https://apps.twitter.com/app/new">https://apps.twitter.com/app/new</a>
Follow the detailed instructions and the screenshots on the tutorial
above.
</p>

<p>
The next step is to authorize your app to access the Twitter account:
</p>
<pre class="example">
useradd --system --create-home twitter
su - twitter
t authorize
</pre>
<p>
The account access info will be stored in ~/.trc as a plain text.
</p>

<p>
Now we can use it like this
</p>
<pre class="example">
$ t account
l10n_sq

$ t whois @dashohoxha
ID           50053789
Since        Jun 23  2009 (8 years ago)
Last update  20+ Free eBooks To Learn Linux For Free https://t.co/PoOMspWYJr (a month ago)
Screen name  @dashohoxha
Name         Dashamir Hoxha
Tweets       1,403
Favorites    21
Listed       5
Following    50
Followers    141

$ t stream timeline

$ t update "Hello there"

$ t follow @dashohoxha @linuxfoundation

$ t mentions -n 10

$ t search timeline "linux"
</pre>

<p>
For more complex usage examples, refer to the <a href="https://github.com/sferik/t/blob/master/README.md">official documentation</a>.
</p>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Getting random proverbs with 'fortune'</h2>
<div class="outline-text-2" id="text-2">
<p>
There is a nice little command, called <code>fortune</code>, which can get and
print a random citation from a file of citations.
</p>

<pre class="example">
apt-get install fortune
fortune
</pre>

<p>
The data files from which it gets the random citations are on
<code>/usr/share/games/fortunes/</code>. The ones with the extension <code>.dat</code> are
binary files (which are used by the command), and those without this
extension are text files. The format of these text files is very
simple: Quotations are separated from each-other by a line that
contains a <code>%</code> sign. It is very easy to create a file that contains
your own list of preferred proverbs or citations. Then convert it to
the binary format with the command:
</p>
<pre class="example">
strfile -c % yourlist yourlist.dat
</pre>

<p>
Now, to get a random item from your list you can run:
</p>
<pre class="example">
fortune yourlist
</pre>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Twitting random items from your lists</h2>
<div class="outline-text-2" id="text-3">
<p>
I use a small script in order to tweet random sayings from my preferred lists:
</p>
<pre class="example">
#!/bin/bash
fortune='/usr/games/fortune'
t='/usr/local/bin/t'
tweet=$($fortune -s -n 140 25% english 75% shqip)
$t update "$tweet"
</pre>

<p>
The main command here is <code>fortune -s -n 140 25% english 75% shqip</code>.
The options <code>-s -n 140</code> makes sure that only short proverbs of up to
140 chars are returned, which are suitable for being twitted. The
arguments <code>25% english 75% shqip</code> ask the command to return something
from the files in the directory <code>/usr/share/games/fortunes/english/</code>
with a probability of 25%, and something from the files in the
directory <code>/usr/share/games/fortunes/shqip/</code> with a probability of 75%
(in the first directory I have collected some English proverbs, and on
the second one some Albanian proverbs). The last step of the script is
to send this random proverb to twitter, with the command =t update
"tweet"=.
</p>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Making it automatic</h2>
<div class="outline-text-2" id="text-4">
<p>
The last thing is to run the script above periodically and
automatically.  This is a job for the good old <code>cron</code>. I have created
the file <code>/etc/cron.d/fortune</code> which has these lines:
</p>
<pre class="example">
### first create a user with `adduser twitter`
0 */5 * * *  twitter  /home/twitter/fortune.sh &gt; /dev/null 2&gt;&amp;1

### uncomment this line only for debugging
#*/5 * * * *  twitter  /home/twitter/fortune.sh
</pre>

<p>
It runs the script each 5 hours, sending posts to twitter automatically.
</p>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Twitting translations from l10n.org.al</h2>
<div class="outline-text-2" id="text-5">
<p>
Another script very similar to the previous one is this:
</p>
<pre class="example">
#!/bin/bash
t='/usr/local/bin/t'
base_url=https://l10n.org.al
tweet=$(curl -k $base_url/btr/tweet)
mention=$( ( $t followings ; $t followers ) | uniq | sort -R | tail -1)
$t update "$tweet @$mention"
</pre>

<p>
This one gets a random translation from l10n.org.al, with the command:
</p>
<pre class="example">
curl -k https://l10n.org.al/btr/tweet
</pre>
<p>
Then it appends to it the name of a random friend and sends it to
twitter.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-03-24</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2017-03-25 Sat 00:23</p>
<p class="validation"></p>
</div>
</body>
</html>
